
word = 'चीज़ों'

suffixes = {
    1: [u'ो',u'े',u'ू',u'ु',u'ी',u'ि',u'ा'],
    2: [u'कर',u'ाओ',u'िए',u'ाई',u'ाए',u'ने',u'नी',u'ना',u'ते',u'ीं',u'ती',u'ता',u'ाँ',u'ां',u'ों',u'ें'],
    3: [u'ाकर',u'ाइए',u'ाईं',u'ाया',u'ेगी',u'ेगा',u'ोगी',u'ोगे',u'ाने',u'ाना',u'ाते',u'ाती',u'ाता',u'तीं',u'ाओं',u'ाएं',u'ुओं',u'ुएं',u'ुआं'],
    4: [u'ाएगी',u'ाएगा',u'ाओगी',u'ाओगे',u'एंगी',u'ेंगी',u'एंगे',u'ेंगे',u'ूंगी',u'ूंगा',u'ातीं',u'नाओं',u'नाएं',u'ताओं',u'ताएं',u'ियाँ',u'ियों',u'ियां'],
    5: [u'ाएंगी',u'ाएंगे',u'ाऊंगी',u'ाऊंगा',u'ाइयाँ',u'ाइयों',u'ाइयां']
}

for L in 5,4,3,2,1:
    if len(word) > L + 1:
        for suf in suffixes[L]:
            if word.endswith(suf):
                print(word[:-L])
